{
  "version": "https://jsonfeed.org/version/1.1",
  "title": "Nerdy Ramblings",
  "language": "en",
  "home_page_url": "https://narayanahari.github.io/",
  "feed_url": "https://narayanahari.github.io/feed/feed.json",
  "description": "Personal blog for sharing my thoughts.",
  "author": {
    "name": "Hari Narayanan",
    "url": "https://narayanahari.github.io/"
  },
  "items": [{
      "id": "https://narayanahari.github.io/posts/readings/",
      "url": "https://narayanahari.github.io/posts/readings/",
      "title": "My reading list in 2023",
      "content_html": "<h1 id=\"books\" tabindex=\"-1\">Books <a class=\"direct-link\" href=\"https://narayanahari.github.io/posts/readings/#books\" aria-hidden=\"true\">#</a></h1>\n<ol>\n<li>The myth of spoiled kids - Alfie Kohn - Read</li>\n<li>Almanack of Naval Ravikanth - Eric Jorgenson - Read</li>\n<li>The courage to be disliked - Ichiro Kishimi &amp; Fumitake koga - Currently Reading - ETA 26th Jan</li>\n</ol>\n<h1 id=\"blogs\" tabindex=\"-1\">Blogs <a class=\"direct-link\" href=\"https://narayanahari.github.io/posts/readings/#blogs\" aria-hidden=\"true\">#</a></h1>\n<p><a href=\"https://fs.blog/\">https://fs.blog/</a>\n<a href=\"https://www.alfiekohn.org/\">https://www.alfiekohn.org/</a></p>\n",
      "date_published": "2023-01-23T00:00:00Z"
    },{
      "id": "https://narayanahari.github.io/posts/startup_ideas/",
      "url": "https://narayanahari.github.io/posts/startup_ideas/",
      "title": "Startup ideas",
      "content_html": "<h1 id=\"summary\" tabindex=\"-1\">Summary <a class=\"direct-link\" href=\"https://narayanahari.github.io/posts/startup_ideas/#summary\" aria-hidden=\"true\">#</a></h1>\n<p>This post contains the list of startup ideas that I see has a potential to become a sizeable (~10M$ revenue) company. I will be listing down the ideas and for each ideas, i will also have a separate post detailing the research i made to analyze the ideas. This is a running list and i will keep adding more ideas as and when i see.</p>\n<h2 id=\"b2b-saas-ideas\" tabindex=\"-1\">B2B Saas Ideas <a class=\"direct-link\" href=\"https://narayanahari.github.io/posts/startup_ideas/#b2b-saas-ideas\" aria-hidden=\"true\">#</a></h2>\n<ol>\n<li>Interview management &amp; employee onboarding platform</li>\n<li>ChatGPT-based code generator to auto-generate unit tests, integration tests.</li>\n<li>Lightweight issue management solution to collaborate and track tasks across multiple parts of the organization. A progress tracker. Also a hierarchical issue management solution.</li>\n<li>Lightweight collaborative IDE, issue manager, note taker - the all-in-one platform</li>\n<li>ChatGPT-based sales email creator which provides personalized emails based on the email recepient's online presence.</li>\n<li>Test engine which tests the wireframe prototype and the actual product images and magically creates issues on any UI discrepancies.</li>\n<li>Service for onboarding a startup company in any geography. Helps startups handle their legal, compliance, accounting requirements. Also help on providing sales, marketing, project tracking templates. A place to discover other startups for collaboration.</li>\n<li>Board games and collaborative engagement solutions for remote working employees.</li>\n<li>Corporate gift management platform.</li>\n<li>Create bots for repeatable tasks. Record tasks performed in the browser and templatize the tasks.</li>\n<li>GIF creator for generating product tutorials. UI previews can be added in the docs.</li>\n<li>Workflow management platform to manage multiple workflows in the company for handling all internal processes. (workflow for reimbursement, applying leaves, creating issues, sending feedbacks etc.)</li>\n<li>Employee overall management - Onboarding, Performance (OKRs), Benefits, Leaves, Rewards and Recognitions, Engagements etc.</li>\n<li>ChatGPT based wireframe generator (low-fi &amp; high-fi). Chat with the bot and generate wireframes for your product.</li>\n</ol>\n",
      "date_published": "2022-12-07T00:00:00Z"
    },{
      "id": "https://narayanahari.github.io/posts/how_startups_evolve/",
      "url": "https://narayanahari.github.io/posts/how_startups_evolve/",
      "title": "How startups evolve ?",
      "content_html": "<p>There is a lot of startup buzz these days. Technology is the main reason for this buzz and its the reason why today so many tech entreprenueres are able to build companies from scratch and take them to million / billion dollar valuations. We are fortunate to live in a world full of opportunities. This was beyond reach even for the last generation humans.</p>\n<p>Objective of this post is to talk about how tech statups evolve and grow, what skill sets required for founders &amp; leaders in every stage of the company.</p>\n<h1 id=\"evolution\" tabindex=\"-1\">Evolution <a class=\"direct-link\" href=\"https://narayanahari.github.io/posts/how_startups_evolve/#evolution\" aria-hidden=\"true\">#</a></h1>\n<p>A startup is born when one or more individuals have a burning desire to solve a problem or provide a service to the market. Once the problem and founding members are identified, the journey of our company starts.</p>\n<p>Generally startups goes through 3 stages. <strong>0-1 stage, 1-10 stage and 10-100</strong>. Each startup follows different operating models in these stages and founders needs different skill sets in operating the company on each of these stages.</p>\n<h2 id=\"0-1-stage\" tabindex=\"-1\">0-1 Stage <a class=\"direct-link\" href=\"https://narayanahari.github.io/posts/how_startups_evolve/#0-1-stage\" aria-hidden=\"true\">#</a></h2>\n<p>Its the timeline between just a startup idea to 500K - 1M ARR. Priority at this stage of a company should be to get the product out as soon as possible so that customers are ready to use and pay for it. This is the pre PFM (Product Market Fit) stage.</p>\n<h3 id=\"role-of-the-founder\" tabindex=\"-1\">Role of the founder <a class=\"direct-link\" href=\"https://narayanahari.github.io/posts/how_startups_evolve/#role-of-the-founder\" aria-hidden=\"true\">#</a></h3>\n<ul>\n<li>Find the right team (of ~10 people) who are passionate to work on the idea.</li>\n<li>Speed of execution (atleast one major release a week).</li>\n</ul>\n<h3 id=\"theme-of-the-company-at-this-stage\" tabindex=\"-1\">Theme of the company at this stage <a class=\"direct-link\" href=\"https://narayanahari.github.io/posts/how_startups_evolve/#theme-of-the-company-at-this-stage\" aria-hidden=\"true\">#</a></h3>\n<ul>\n<li>Speed trumps everything. No place for optimization or scale. Just ship as many features as possible so that your customers cuts you checks.</li>\n</ul>\n<p>In recent times, i read few articles where companies are successful without going through this 0-1 stage of getting quick MVP (minimum viable product) and iterate. Figma is an example where the founders started their work on 2012 and the first public beta was released on 2015. For 3 full years, the founders were working on Figma's first beta launch and still Figma was able to run successful company and exit.</p>\n<p><strong>My take</strong></p>\n<p>0-1 stage of a startup is all about fighting for survival. The only possible way a startup fail at this stage is by running out of cash. Product is bound to pivot. So startups should focus on getting the cash to survive either by sellling the product to customers or find a investor to get a longer runway. (In case of Figma, Dylan Field - CEO and Founder of Figma is a Theil Fellow who got 3.8M $ in 2013 just in one year after starting the company).</p>\n<h2 id=\"1-10-stage\" tabindex=\"-1\">1-10 Stage <a class=\"direct-link\" href=\"https://narayanahari.github.io/posts/how_startups_evolve/#1-10-stage\" aria-hidden=\"true\">#</a></h2>\n<p>Its the timeline between your first paying customer (or first investor) to building a sizeable customer base to consistently get a revenue of 500K to 10M ARR. This stage is all about growth &amp; scale so that new customers can easily oboard easily and existing customers can use your product at ease.</p>\n<h3 id=\"role-of-the-founder-1\" tabindex=\"-1\">Role of the founder <a class=\"direct-link\" href=\"https://narayanahari.github.io/posts/how_startups_evolve/#role-of-the-founder-1\" aria-hidden=\"true\">#</a></h3>\n<ul>\n<li>Create processes to run day to day operations.</li>\n<li>Hiring the right people - This is the most important aspect and determines further success. Founders should look for people having skills or potential and passionate about solving problem for the company.</li>\n<li>Update the product to handle scale (wrt to different customer requirements). Also focus a bit on optimization as well.</li>\n<li>Setup the culture by defining what the company stands for.</li>\n</ul>\n<h3 id=\"theme-for-the-company\" tabindex=\"-1\">Theme for the company <a class=\"direct-link\" href=\"https://narayanahari.github.io/posts/how_startups_evolve/#theme-for-the-company\" aria-hidden=\"true\">#</a></h3>\n<ul>\n<li>Growth and Increase the length of runway.</li>\n</ul>\n<p>Once the team is onboarded and the flywheel starts in the positive direction, founders should slowly shift thier focus from day to day operations to medium term strategies like brand building, community building, product positioning so that the startup is ready to take the next stage.</p>\n<p>This part of the startup life can be referred as <strong>Scale &amp; Grow</strong></p>\n<h2 id=\"10-100-stage\" tabindex=\"-1\">10-100 Stage <a class=\"direct-link\" href=\"https://narayanahari.github.io/posts/how_startups_evolve/#10-100-stage\" aria-hidden=\"true\">#</a></h2>\n<p>This the timeline between 10M to 100M ARR where the company will be competing against the big boys for fat contracts. At this stage, startup should look to provide competitive offering so that company's name should be considered as a verb (like google for search, slack for chat etc) in their respective domain.</p>\n<p>At this stage, startups should consider expanding horizontally by offering more products and features and broaden their total adressable market size.</p>\n<h3 id=\"role-of-the-founders\" tabindex=\"-1\">Role of the founders <a class=\"direct-link\" href=\"https://narayanahari.github.io/posts/how_startups_evolve/#role-of-the-founders\" aria-hidden=\"true\">#</a></h3>\n<ul>\n<li>Strategy for long term (3-5 yrs) and encourage the leadership to think long term.</li>\n<li>Setup the leadership team with broad responsibilities and goals.</li>\n<li>Evangelize the product by conducting conferences, events, talks etc.</li>\n<li>Completely move away from day to day operations but should be willing to get to the details and fire-fighting as on when required.</li>\n</ul>\n<h3 id=\"theme-for-the-company-1\" tabindex=\"-1\">Theme for the company <a class=\"direct-link\" href=\"https://narayanahari.github.io/posts/how_startups_evolve/#theme-for-the-company-1\" aria-hidden=\"true\">#</a></h3>\n<ul>\n<li>Build high quality product.</li>\n<li>Optimize cost</li>\n<li>Raise the overall bar and set standards for others to follow.</li>\n</ul>\n<p>This part of the startup life is called <strong>Showcase</strong></p>\n<p>Lot of great content is available in the internet which talks about how companies handled these stages in detail. Further reading pointers about startups and startup evolution can be from these links below -</p>\n<ul>\n<li><a href=\"https://www.startupschool.org/\">https://www.startupschool.org/</a></li>\n<li><a href=\"https://www.failory.com/\">https://www.failory.com/</a></li>\n<li><a href=\"https://www.indiehackers.com/interviews/\">https://www.indiehackers.com/interviews/</a></li>\n</ul>\n<p><em>NOTE: I am no startup expert. I didnt start or ran a successful startup company. The above post is just my observation so far while closely following the tech startup scene. As mentioned in my about section page, the posts in this site are just reflection of my thoughts which i believe will help me in providing more clarity to my thoughts. So take it with a pinch of salt.</em></p>\n",
      "date_published": "2022-12-07T00:00:00Z"
    },{
      "id": "https://narayanahari.github.io/posts/2023/",
      "url": "https://narayanahari.github.io/posts/2023/",
      "title": "My 2023 Goals",
      "content_html": "<h2 id=\"my-goals-for-2023\" tabindex=\"-1\">My goals for 2023 <a class=\"direct-link\" href=\"https://narayanahari.github.io/posts/2023/#my-goals-for-2023\" aria-hidden=\"true\">#</a></h2>\n<ol>\n<li>Health is the important asset and I have to ensure that atleast i am up by 8 kgs by the end of this year. As of now I am 58 kgs and i should be 66 kgs by end of this year and the weight should be muscle mass and not pot belly.</li>\n<li>Start investing in right instruments like startups, real estates, stocks which has the potential to compound in long run.</li>\n<li>Start and run a blog consistently. Minimum 1 post a week. 52 posts this year.</li>\n<li>Read 52 books and write review for each book as a separate blog post.\n4.a - Read 50 pages every day. So you have to spend 1.5 hrs every day for reading.</li>\n<li>Spend 2 hrs in the morning with kids and 1 hr at night.</li>\n<li>Learn cooking and art.</li>\n<li>Eat junk food once a week and dont eat any food (except water) after 9 PM at night.</li>\n<li>Collect the ideas and build something consistently. Once a month, launch something. Atleast 10-12 products should be launched this year.</li>\n</ol>\n",
      "date_published": "2022-12-07T00:00:00Z"
    }
  ]
}
